Revit 2027 API
BuiltInFailures.HostedWallAssociationFailures.PinnedElemCannotInteractWarn Property
 The selected wall is pinned and cannot interact with the target host.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId PinnedElemCannotInteractWarn { get; }
Public Shared ReadOnly Property PinnedElemCannotInteractWarn As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ PinnedElemCannotInteractWarn {
	FailureDefinitionId^ get ();
}
static member PinnedElemCannotInteractWarn : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.HostedWallAssociationFailures Class
Autodesk.Revit.DB Namespace